In [1]:
import pandas as pd

crimeCountData = pd.read_csv('UK/appendixtablesyedec22.csv', encoding='utf-8')

crimeCountData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 239 entries, 0 to 238
Data columns (total 26 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Offence code                      198 non-null    object
 1   Offence category                  239 non-null    object
 2   Apr 2002 to
 Mar 2003            147 non-null    object
 3   Apr 2003 to
 Mar 2004            149 non-null    object
 4   Apr 2004 to
 Mar 2005            166 non-null    object
 5   Apr 2005 to
 Mar 2006            167 non-null    object
 6   Apr 2006 to
 Mar 2007            167 non-null    object
 7   Apr 2007 to
 Mar 2008            175 non-null    object
 8   Apr 2008 to
 Mar 2009            190 non-null    object
 9   Apr 2009 to
 Mar 2010            186 non-null    object
 10  Apr 2010 to
 Mar 2011            185 non-null    object
 11  Apr 2011 to
 Mar 2012            187 non-null    object
 12  Apr 2012 to
 Mar 2013            165 non-null    object
 13  Apr 2013 to
 Mar 2014            159 non-null    object
 14  Apr 2014 to
 Mar 2015            158 non-null    object
 15  Apr 2015 to
 Mar 2016            159 non-null    object
 16  Apr 2016 to
 Mar 2017            158 non-null    object
 17  Apr 2017 to
 Mar 2018            159 non-null    object
 18  Apr 2018 to
 Mar 2019            159 non-null    object
 19  Apr 2019 to
 Mar 2020            161 non-null    object
 20  Apr 2020 to
 Mar 2021            163 non-null    object
 21  Apr 2021 to
 Mar 2022            163 non-null    object
 22  Jan 2021 to
 Dec 2021            163 non-null    object
 23  Jan 2022 to Dec 2022              163 non-null    object
 24  Dec 2022 with Mar 2020
% change  161 non-null    object
 25  Dec 2022 with Dec 2021
% change  162 non-null    object
dtypes: object(26)
memory usage: 48.7+ KB

In [2]:
select_columns=['Offence category', 'Jan 2022 to Dec 2022']

revisedCrimeCount = crimeCountData[select_columns]

revisedCrimeCount.head()

         Offence category Jan 2022 to Dec 2022
0     VICTIM BASED CRIME             4,500,594
1         Murder [note 3]                  542
2   Manslaughter [note 3]                   76
3  Corporate manslaughter                   13
4             Infanticide                    1

In [3]:
revisedCrimeCount_index = revisedCrimeCount.set_index('Offence category')

revisedCrimeCount_index.head()

                       Jan 2022 to Dec 2022
Offence category
VICTIM BASED CRIME                4,500,594
Murder [note 3]                         542
Manslaughter [note 3]                    76
Corporate manslaughter                   13
Infanticide                               1

In [4]:
noNull_Crime_Index = revisedCrimeCount_index.fillna('0')

noNull_Crime_Index.head(12)

                                                   Jan 2022 to Dec 2022
Offence category
VICTIM BASED CRIME                                            4,500,594
Murder [note 3]                                                     542
Manslaughter [note 3]                                                76
Corporate manslaughter                                               13
Infanticide                                                           1
Homicide [note 3,4,5,6,7,8]                                         632
Causing death or serious injury by dangerous dr...                  663
Causing death by careless driving when under th...                   20
Causing death by careless or inconsiderate driving                   99
Causing death by dangerous or careless driving                        0
Causing death by driving: unlicensed or disqual...                   26
Causing death by aggravated vehicle taking                            5

In [5]:
str(noNull_Crime_Index['Jan 2022 to Dec 2022'].dtype)

'object'

In [6]:
noNull_Crime_Index['Jan 2022 to Dec 2022'] = [x.replace(',', '') for x in noNull_Crime_Index['Jan 2022 to Dec 2022']]

noNull_Crime_Index['Count'] = pd.to_numeric(noNull_Crime_Index['Jan 2022 to Dec 2022'])

noNull_Crime_Index.head()

                       Jan 2022 to Dec 2022    Count
Offence category
VICTIM BASED CRIME                  4500594  4500594
Murder [note 3]                         542      542
Manslaughter [note 3]                    76       76
Corporate manslaughter                   13       13
Infanticide                               1        1

In [7]:
refined_index_crime = noNull_Crime_Index['Count']

refined_index_crime.head()

Offence category
VICTIM BASED CRIME        4500594
Murder [note 3]               542
Manslaughter [note 3]          76
Corporate manslaughter         13
Infanticide                     1
Name: Count, dtype: int64

In [8]:
noNull_Crime_Index.index

Index(['VICTIM BASED CRIME ', 'Murder [note 3]', 'Manslaughter [note 3]',
       'Corporate manslaughter', 'Infanticide', 'Homicide [note 3,4,5,6,7,8]',
       'Causing death or serious injury by dangerous driving [note 9]',
       'Causing death by careless driving when under the influence of drink or drugs                                                                               ',
       'Causing death by careless or inconsiderate driving',
       'Causing death by dangerous or careless driving',
       ...
       'Fraud by failing to disclose information [note 50]',
       'Fraud by abuse of position [note 50]',
       'Obtaining services dishonestly [note 50]',
       'Bankruptcy and insolvency offences ',
       'TOTAL FRAUD OFFENCES RECORDED BY THE POLICE [note 57]',
       'Fraud and computer misuse offences recorded by Action fraud  [note 57, 58, 59]',
       'Fraud offences referred to NFIB by Cifas [note 58, 59]',
       'Fraud offences referred to NFIB by UK Finance [note 58 ,60, 61, 62, 63, 64]',
       'TOTAL FRAUD  AND COMPUTER MISUSE OFFENCES [note 63]',
       'TOTAL RECORDED CRIME ? ALL OFFENCES INCLUDING FRAUD AND COMPUTER MISUSE [note 55,63 ]'],
      dtype='object', name='Offence category', length=239)

In [9]:
theft_crime = refined_index_crime.loc[['TOTAL THEFT OFFENCES']]
theft_crime.head()

Offence category
TOTAL THEFT OFFENCES    1648404
Name: Count, dtype: int64

In [10]:
assault_crime = refined_index_crime.loc[['Violence with injury', 'Violence without injury']]

assault_crime.head()

Offence category
Violence with injury       558886
Violence without injury    811873
Name: Count, dtype: int64

In [11]:
murder_crime = refined_index_crime.loc[['Homicide [note 3,4,5,6,7,8]']]

murder_crime.head()

Offence category
Homicide [note 3,4,5,6,7,8]    632
Name: Count, dtype: int64

In [12]:
rape_crime = refined_index_crime.loc[['Rape']]
rape_crime.head()

Offence category
Rape    67169
Name: Count, dtype: int64

In [13]:
final_data = {'Count': [murder_crime.sum(), rape_crime.sum(), theft_crime.sum(), assault_crime.sum()]}

final_data

{'Count': [632, 67169, 1648404, 1370759]}

In [14]:
final_df = pd.DataFrame(final_data, index=['살인', '강간', '절도', '폭행'])

final_df

      Count
살인      632
강간    67169
절도  1648404
폭행  1370759

In [15]:
PoliceCountData = pd.read_csv('UK/UK number of police.csv', encoding='utf-8')

PoliceCountData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Year                       9 non-null      int64
 1   Number of Police Officers  9 non-null      object
dtypes: int64(1), object(1)
memory usage: 276.0+ bytes

In [16]:
PopulationData = pd.read_csv('UK/UK population.csv', encoding='utf-8')

PopulationData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   year        13 non-null     int64
 1   population  13 non-null     int64
dtypes: int64(2)
memory usage: 340.0 bytes

In [17]:
selected_columns = ['year', 'population']

revisedPopulationData = PopulationData[selected_columns]

revisedPopulationData.head()

   year  population
0  2010    62759500
1  2011    63285100
2  2012    63705000
3  2013    64105700
4  2014    64596800

In [18]:
PoliceCountData.head()

   Year Number of Police Officers
0  2015                   154,000
1  2016                   151,000
2  2017                   150,000
3  2018                   150,000
4  2019                   150,000

In [19]:
revisedPopulationData = revisedPopulationData.set_index('year')

PoliceCountData = PoliceCountData.set_index('Year')

In [20]:
str(revisedPopulationData.index.dtype)

'int64'

In [21]:
str(PoliceCountData.index.dtype)

'int64'

In [22]:
str(revisedPopulationData['population'].dtype)

'int64'

In [23]:
str(PoliceCountData['Number of Police Officers'].dtype)

'object'

In [24]:
revisedPopulationData['PopulationCount'] = revisedPopulationData['population']

revisedPopulationData.head(15)

      population  PopulationCount
year
2010    62759500         62759500
2011    63285100         63285100
2012    63705000         63705000
2013    64105700         64105700
2014    64596800         64596800
2015    65110000         65110000
2016    65648100         65648100
2017    66040200         66040200
2018    66435600         66435600
2019    66796800         66796800
2020    67081000         67081000
2021    67026300         67026300
2022    67596300         67596300

In [25]:
numericPopulationData = revisedPopulationData.drop(columns = ['population'])

numericPopulationData.head()

      PopulationCount
year
2010         62759500
2011         63285100
2012         63705000
2013         64105700
2014         64596800

In [26]:
combinedPolicePopulation = pd.merge(PoliceCountData, numericPopulationData, left_index=True, right_index=True, how='outer')

combinedPolicePopulation.head()

     Number of Police Officers  PopulationCount
2010                       NaN       62759500.0
2011                       NaN       63285100.0
2012                       NaN       63705000.0
2013                       NaN       64105700.0
2014                       NaN       64596800.0

In [27]:
print(combinedPolicePopulation)

     Number of Police Officers  PopulationCount
2010                       NaN       62759500.0
2011                       NaN       63285100.0
2012                       NaN       63705000.0
2013                       NaN       64105700.0
2014                       NaN       64596800.0
2015                   154,000       65110000.0
2016                   151,000       65648100.0
2017                   150,000       66040200.0
2018                   150,000       66435600.0
2019                   150,000       66796800.0
2020                   153,000       67081000.0
2021                   160,000       67026300.0
2022                   164,000       67596300.0
2023                   171,000              NaN

In [28]:
finalPolicePopulation = combinedPolicePopulation.loc[2022]

finalPolicePopulation.head()

Number of Police Officers       164,000
PopulationCount              67596300.0
Name: 2022, dtype: object

In [29]:
finalPolicePopulationData = pd.DataFrame({'Count': [finalPolicePopulation['Number of Police Officers'], finalPolicePopulation['PopulationCount']]}, index=['총경찰관수', '총인구수'])
finalPolicePopulationData.head()

            Count
총경찰관수     164,000
총인구수   67596300.0

In [30]:
cctvData = {'cctvCount': [689000, 83000, 58000, 46000, 43000, 39000, 38000, 36000, 33000]}

In [31]:
revisedcctvData = pd.DataFrame(cctvData)
revisedcctvData.head()

   cctvCount
0     689000
1      83000
2      58000
3      46000
4      43000

In [32]:
revisedcctvData['Count'] = revisedcctvData['cctvCount']
revisedcctvData.head()

   cctvCount   Count
0     689000  689000
1      83000   83000
2      58000   58000
3      46000   46000
4      43000   43000

In [33]:
count = revisedcctvData['Count'].sum()
revisedcctvData['Count'] = count

In [34]:
revisedcctvData.head()

   cctvCount    Count
0     689000  1065000
1      83000  1065000
2      58000  1065000
3      46000  1065000
4      43000  1065000

In [35]:
revisedcctvData = revisedcctvData.drop(columns=['cctvCount'])
revisedcctvData.head()

     Count
0  1065000
1  1065000
2  1065000
3  1065000
4  1065000

In [36]:
populationCount = finalPolicePopulation['PopulationCount']

In [37]:
finalcctvData = pd.DataFrame({'Count': [revisedcctvData['Count'][0], finalPolicePopulation['PopulationCount']]}, index=['총CCTV수', '총인구수'])

finalcctvData.head()

             Count
총CCTV수   1065000.0
총인구수    67596300.0

In [40]:
recidivismData = pd.read_csv('UK/recidivism.csv', encoding='utf-8')
recidivismData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             13 non-null     int64
 1   Recidivism Rate  13 non-null     object
dtypes: int64(1), object(1)
memory usage: 340.0+ bytes

In [42]:
select_columns = ['Recidivism Rate']
revisedRecidivism = recidivismData[select_columns]
revisedRecidivism.head()

  Recidivism Rate
0           31.6%
1           30.9%
2             30%
3             30%
4           29.8%

In [46]:
revisedRecidivism['Recidivism Rate'] = [x.replace('%', '') for x in revisedRecidivism['Recidivism Rate']]
revisedRecidivism['Rate'] = pd.to_numeric(revisedRecidivism['Recidivism Rate'])
revisedRecidivism.head(13)

   Recidivism Rate  Rate
0             31.6  31.6
1             30.9  30.9
2               30  30.0
3               30  30.0
4             29.8  29.8
5               30  30.0
6             28.9  28.9
7             28.5  28.5
8             28.5  28.5
9             27.4  27.4
10            25.1  25.1
11              24  24.0
12            24.9  24.9

In [47]:
finalrecidivismData = pd.DataFrame({'Count' : [revisedRecidivism['Rate'][12]]}, index = ['재범률'])
finalrecidivismData.head()

     Count
재범률   24.9